App({
  z:{
    i:wx.getSystemInfoSync(),
    l:wx.getMenuButtonBoundingClientRect(),//头部信息
    o:[0,0,0,''], //时间参数都是数组 0补0的年月日 || 1无0的年月日 || 2 00点 当前 24点的时间戳 || 农历年月日
    h:[0,0,wx.getStorageSync('c'),0,0], //页面状态改变 0位 头部高度 1主页的状态 2判断是否关闭了个人中心的提示 3 判断分页是否增加了收藏   
    u:wx.getStorageSync('u'), //用户头像名称
    k:[wx.getStorageSync('t')] , //有效缓存判定 0 
    z:wx.getStorageSync('z'), //基本数据 
    s:[//a 序号id b名称 c收藏数 d应用描述 e说明标识 f,j占用不直接写入 i对应栏目【1热点2金融3诗歌4爱情5生活6历史7问答】
      {a:702,b:'猜灯谜',c:0,d:'传统文化--灯谜娱乐',i:[1,0,0,0,0,0,0,1],u:'c'},
      {a:516,b:'十万个为什么',c:0,d:'科学阐述日常所见的问题',i:[1,0,0,0,0,1,0,0],u:'a'},    
      {a:308,b:'名人名言',c:0,d:'直达心灵的智慧名言',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:310,b:'古籍名句',c:0,d:'华夏古籍名言及出处',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:307,b:'经典台词',c:0,d:'海内外经典影视台词',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:406,b:'古代情诗',c:0,d:'浪漫唯美的古情诗',i:[1,0,0,0,1,0,0,0],u:'a'},      
      {a:411,b:'脑筋急转弯',c:0,d:'高IQ必备急转弯',i:[1,0,0,0,1,0,0,0],u:'a'},
      {a:101,b:'网络搜索热点',c:0,d:'互联网实时热点事件',i:[1,1,0,0,0,0,0,0],u:'a'},
      {a:102,b:'抖音热点榜',c:0,d:'3分钟内抖音热点视频榜',i:[1,1,0,0,0,0,0,0],u:'a'},
      {a:103,b:'微博热搜榜',c:0,d:'国内实时舆论行情',i:[1,1,0,0,0,0,0,0],u:'a'},
      {a:104,b:'网易云热评',c:0,d:'网易云音乐热评精选',i:[1,1,0,0,0,0,0,0],u:'a'},
      {a:105,b:'神回复',c:0,d:'惊天地泣鬼神的神回复',i:[1,1,0,0,0,0,0,0],u:'a'},
      {a:301,b:'全唐诗集',c:0,d:'这里有唐朝所有的诗...',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:302,b:'精选宋词',c:0,d:'精选以近体诗和格律词为代表的宋词',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:303,b:'古谚语',c:0,d:'口口相传的古谚语',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:304,b:'顺口溜',c:0,d:'民间流传的口头韵文',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:305,b:'歇后语',c:0,d:'风趣且带有谜语韵味',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:306,b:'绕口令',c:0,d:'初入江湖都会化肥会挥发',i:[1,0,0,1,0,0,0,0],u:'a'},
      {a:309,b:'成语典故',c:0,d:'探寻成语的典故与来源',i:[1,0,0,1,0,0,0,0],u:'b'},
      {a:405,b:'藏头诗',c:0,d:'随机生成2-8字的藏头诗',i:[1,0,0,1,1,0,0,0],u:'b'},
      {a:407,b:'彩虹屁',c:0,d:'喜欢他（她）就要夸出来',i:[1,0,0,0,1,0,0,0],u:'a'},
      {a:408,b:'舔狗日志',c:0,d:'记录卑微的爱情',i:[1,0,0,0,1,0,0,0],u:'a'},
      {a:409,b:'土味情话',c:0,d:'甜到腻嘴 撩到心氧',i:[1,0,0,0,1,0,0,0],u:'a'},
      {a:410,b:'分手语录',c:0,d:'过去的总会过去，请珍惜现在！',i:[1,0,0,0,1,0,0,0],u:'a'},
      {a:501,b:'朋友圈文案',c:0,d:'简单走心的朋友圈文案',i:[1,0,0,0,0,1,0,0],u:'a'},
      {a:503,b:'垃圾分类',c:0,d:'根据政策和指导建议优化分类',i:[1,0,0,0,0,1,0,0],u:'b'},
      {a:504,b:'早安心语',c:0,d:'一句励志的话为新的一天加油',i:[1,0,0,0,1,1,0,0],u:'a'},
      {a:505,b:'晚安心语',c:0,d:'暖心一句话愿君好梦',i:[1,0,0,0,1,1,0,0],u:'a'},
      {a:506,b:'生活小窍门',c:0,d:'实用的生活小技巧',i:[1,0,0,0,0,1,0,0],u:'a'},
      {a:507,b:'地理杂志',c:0,d:'国内城市景区的人土风俗',i:[1,0,0,0,0,1,1,0],u:'b'},
      {a:9,b:'道济天下',c:0,d:'饱含韵味的精致藏品',i:[1,0,0,0,0,1,0,0],u:'',k:['跳转的小程序appid']}, 
      {a:515,b:'大写金额',c:0,d:'金额数字转中英文大写',i:[1,0,0,0,0,1,0,0],u:'b'},
      {a:513,b:'周公解梦',c:0,d:'梦也许预示着某种含义',e:'解梦说明',i:[1,0,0,0,0,1,0,0],u:'b'},
      {a:508,b:'中药大全',c:0,d:'请在医师的指导下使用药物',i:[1,0,0,0,0,1,0,0],u:'b'},
      {a:509,b:'营养成分表',c:0,d:'饮食健康参考资料',i:[1,0,0,0,0,1,0,0],u:'b'},
      {a:510,b:'菜谱百科',c:0,d:'美味菜肴制作方法查询',i:[1,0,0,0,0,1,0,0],u:'b'},
      {a:511,b:'同声传译',c:0,d:'中英文实时翻译',i:[1,0,0,0,0,1,0,0],u:'',k:['跳转的小程序appid','跳转路径，为空时默认首页']},
      {a:512,b:'小段子',c:0,d:'品味不一样的生活',i:[1,0,0,0,0,1,0,0],u:'a'},
      {a:601,b:'姓氏起源',c:0,d:'百家姓的历史起源和典故',i:[1,0,0,0,0,0,1,0],u:'b'},
      {a:602,b:'历史一句话',c:0,d:'简述历史事件',i:[1,0,0,0,0,0,1,0],u:'a'},
      {a:603,b:'历史的今天',c:0,d:'以史为鉴，可以知兴替。',i:[1,0,0,0,0,0,1,0],u:'a'},
      {a:701,b:'猜字谜',c:0,d:'传统文化--字谜游戏',i:[1,0,0,0,0,0,0,1],u:'c'},
      {a:703,b:'猜成语',c:0,d:'传统文化之猜成语',i:[1,0,0,0,0,0,0,1],u:'c'}
    ]
  },
  onLaunch(options) {this.z.c=options.scene;this.z.h[0]=this.z.l.height+this.z.l.top+19+this.z.i.windowWidth*0.03;if(options.query.b){this.z.g=options.query.b}}
})